Revit 2027 API
ParameterTypeId.RailingSystemHasTopRail Property
 "Use Top Rail": Whether railing has top rail
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RailingSystemHasTopRail { get; }
Public Shared ReadOnly Property RailingSystemHasTopRail As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RailingSystemHasTopRail {
	ForgeTypeId^ get ();
}
static member RailingSystemHasTopRail : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace